const requestUrl = 'http://api.justin.ua/justin_pms_test/hs/v2/runRequest';
const invocation = new XMLHttpRequest();
const logPass = "Exchange";

const callJustinApi = () =>{
    if (invocation){
        invocation.open("GET", requestUrl, true)


    }
}

// const XMLHttpRequest = require("xmlhttprequest").XMLHttpRequest;
// const xhr = new XMLHttpRequest()
// xhr.open(
//     'GET',
//     requestUrl,
//     true,
//     "Exchange",
//     "Exchange")
// xhr.send()
// xhr.onreadystatechange = () => {
//     if (xhr.status === 0){
//         console.log(xhr.status, 'загрузка')
//     }else if(xhr.status === 200) {
//         console.log('result', xhr.status, JSON.parse(xhr.responseText))
//     }else {
//         console.log('err', xhr.status)
//     }
// }

const initialState = {
    HEADERS:{
        TITLE:"Калькулятор",
        SUB_TITLE:"Розрахуйте вартість"
    },
    LABELS:{
        FROM:{TEXT:"Звідки:",ID:"from"},
        TO:{TEXT:"Куди:",ID:"to"},
        WEIGHT:{TEXT:"Вага:",ID:"weight"},
        LENGH:{TEXT:"Вага:",ID:"length"}
    },
    OPTIONS:{
        FROM:"Оберіть місто",
        TO:"Оберіть місто",
        WEIGHT:"Оберіть вагу",
        LENGH:"Оберіть довжину"
    },
    BTN:{
        TEXT:"Розрахувати вартість",
        TYPE:"submit"
    },
    City: [
        "Івано-Франківськ",
        "Ізмаїл",
        "Ірпінь",
        "Баришівка",
        "Бахмач",
        "Бахмут",
        "Бердичів",
        "Бердянськ",
        "Березань",
        "Бобровиця",
        "Богуслав",
        "Борислав",
        "Бориспіль",
        "Бородянка",
        "Бровари",
        "Біла Церква",
        "Білогородка",
        "Васильків",
        "Вишгород",
        "Вишневе",
        "Ворзель",
        "Вінниця",
        "Віта-Поштова",
        "Гайсин",
        "Гатне",
        "Глеваха",
        "Гнідин",
        "Гоголів",
        "Гора",
        "Городня",
        "Гребінки",
        "Дніпро",
        "Дніпрорудне",
        "Дрогобич",
        "Дружківка",
        "Жидачів",
        "Житомир",
        "Жмеринка",
        "Зазимя",
        "Запоріжжя",
        "Золочів",
        "Калинівка",
        "Кам'янець-Подільський",
        "Кам'янське",
        "Київ",
        "Княжичі",
        "Ковель",
        "Козелець",
        "Коломия",
        "Конотоп",
        "Коростень",
        "Коростишів",
        "Костянтинівка",
        "Коцюбинське",
        "Кременчук",
        "Кривий Ріг",
        "Кропивницький",
        "Крюківщина",
        "Куп'янськ",
        "Ладижин",
        "Лисичанськ",
        "Лозова",
        "Луцьк",
        "Львів",
        "Лютіж",
        "Малин",
        "Маріуполь",
        "Мелітополь",
        "Миколаїв",
        "Миргород",
        "Миронівка",
        "Мукачеве",
        "Новий Розділ",
        "Новоград-Волинський",
        "Новомосковськ",
        "Новосілки",
        "Нові Петрівці",
        "Ніжин",
        "Нікополь",
        "Обухів",
        "Овідіополь",
        "Одеса",
        "Олександрія",
        "Остер",
        "Охтирка",
        "Павлоград",
        "Петропавлівська Борщагівка",
        "Погреби",
        "Полтава",
        "Прилуки",
        "Проліски",
        "Рава-Руська",
        "Рокитне",
        "Рівне",
        "Самбір",
        "Святопетрівське",
        "Славутич",
        "Слов'янськ",
        "Сміла",
        "Сокаль",
        "Софіївська Борщагівка",
        "Ставище",
        "Старокостянтинів",
        "Стоянка",
        "Стрий",
        "Суми",
        "Сєвєродонецьк",
        "Тараща",
        "Теплодар",
        "Тернопіль",
        "Трускавець",
        "Тульчин",
        "Ужгород",
        "Узин",
        "Умань",
        "Фастів",
        "Харків",
        "Херсон",
        "Хмельницький",
        "Хмільник",
        "Хотянівка",
        "Христинівка",
        "Червоноград",
        "Черкаси",
        "Чернівці",
        "Чернігів",
        "Чорноморськ",
        "Щасливе",
        "Южне",
        "Южноукраїнськ",
        "Яготин"
    ],
    weight: [0.5,1,2,5,10,15,30],
    length: [40, 60, 90],
}

export const calcaculate = (state = initialState, action) =>{
    return state
}
