export const data = {
    params: [{
        initParam: {
            name: "slice",
            array: [1, 2, 4, 8, 10, 30, 50],
            info: "Метод slice() повертає дрібну копію частини масиву у новий масив, починаючи з begin і до end (не включаючи end), де begin та end є індексами елементів масиву. Початковий масив не змінюється."
        },
        parameters: [2, 5]
    }, {
        initParam: {
            name: "splice",
            array: [2, 1, 8, 10, 30, 50],
            info: "Метод splice() змінює вміст масиву, видаляючи існуючі та/або додаючи нові елементи."
        },
        parameters: [0, 2, "323", "test", 11]
    }, {
        initParam: {
            name: "concat",
            array: ["a", "b", "c", "test"],
            info: "Метод concat() повертає новий масив, що складається із масиву, в контексті якого метод був викликаний, поєднаного із масивом (масивами) та/або іншими значеннями, що були передані як аргументи."
        },
        parameters: [[1, 2, 3], [7, 8, 9], [2, [3]], 1]
    }]
};
