const news = [
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
	{
		img: "568x450_novosti_Os_kab.jpg",
		title: "Justin доставлятиме товари з iZi",
		date: "21.02.2020",
		description: "Поштовий оператор оголосив про старт роботи з гіперпростором оголошень. У..."
	},
]

export default news;
